tap "hashicorp/tap"
brew "ack"
brew "asdf"
brew "automake"
brew "awscli"
brew "bison"
brew "clusterawsadm"
brew "clusterctl"
brew "colordiff"
brew "ctags"
brew "docker"
brew "docker-compose"
brew "ffmpeg"
brew "flex"
brew "icu4c@78"
brew "fop"
brew "fzf"
brew "gnupg"
brew "helm"
brew "icu4c@76"
brew "icu4c@77"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "libpq"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "llm"
brew "openclaw-cli"
brew "neovim"
brew "ollama", restart_service: :changed
brew "protobuf"
brew "pure"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "socat"
brew "telnet"
brew "the_silver_searcher"
brew "thrift"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "wxwidgets"
brew "hashicorp/tap/terraform"
cask "1password"
cask "android-platform-tools"
cask "aws-vpn-client"
cask "chatbox"
cask "claude"
cask "openclaw"
cask "claude-code"
cask "cursor"
cask "datagrip"
cask "discord"
cask "docker-desktop"
cask "drawio"
cask "dropbox"
cask "flux-app"
cask "goland"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "lm-studio"
cask "macvim-app"
cask "obsidian"
cask "pycharm"
cask "qq"
cask "rectangle"
cask "slack"
cask "sublime-text"
cask "tailscale-app"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "wechat"
cask "whatsapp"
cask "zed"
cask "zoom"
vscode "1yib.rust-bundle"
vscode "continue.continue"
vscode "dustypomerleau.rust-syntax"
vscode "fill-labs.dependi"
vscode "golang.go"
vscode "jakebecker.elixir-ls"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
